tap "homebrew/bundle"
tap "homebrew/cask"
tap "oven-sh/bun"

# Core tools
brew "git"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "powerlevel10k"
brew "tmux"
brew "mas"
brew "direnv"
brew "oven-sh/bun/bun"
brew "kubectl"
brew "kubectx"

# Shell enhancements & Git workflow
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "eza"
brew "bat"
brew "zoxide"
brew "git-delta"
brew "lazygit"
brew "jq"
brew "yq"
brew "gh"

# Neovim formatters
brew "stylua"

# Kubernetes & Observability
brew "k9s"
brew "stern"
brew "btop"
brew "httpie"

cask "iterm2"
cask "raycast"
